Actually I figured it out: the docs are correct though the behavior is a bit confusing. When passing an access group name as a parameter to the AG data source, you will still be returned a _list_ containing the single matching access group. 

So do this:
```
data "ibm_iam_access_group" "conductor" {
  access_group_name = "Conductor"
}

resource "ibm_iam_access_group_members" "conductor-members" {
  access_group_id = data.ibm_iam_access_group.<thing>.groups[0].id
  ...
}
```

to get this output from TF plan:
```
  # ibm_iam_access_group_members.conductor-members will be created
  + resource "ibm_iam_access_group_members" "conductor-members" {
      + access_group_id = "AccessGroupId-REDACTED"
      + ibm_ids         = [
         REDACTED
        ]
      + id              = (known after apply)
      + members         = (known after apply)
    }
  # ibm_iam_access_group_policy.conductor-policy will be created
  + resource "ibm_iam_access_group_policy" "conductor-policy" {
      + access_group_id    = "AccessGroupId-REDACTED"
      + account_management = false
      + id                 = (known after apply)
      + roles              = [
          + "Viewer",
          + "Reader",
          + "Writer",
        ]
      + version            = (known after apply)
      + resources {
          + attributes           = {
              + "namespace" = "conductor"
            }
          + resource_group_id    = "REDACTED"
          + resource_instance_id = "REDACTED"
          + service              = "containers-kubernetes"
        }
    }
```

The reason the account ID can be obtained as `data.ibm_iam_access_group.<thing>.id` is because of this: https://github.com/IBM-Cloud/terraform-provider-ibm/blob/master/ibm/data_source_ibm_iam_access_group.go#L194